app/Controllers/Produk.php

SELECT *
FROM "produk"
WHERE "nama_produk" LIKE '%%' ESCAPE '!'
OR  "kategori_produk" LIKE '%%' ESCAPE '!'
SELECT *
FROM "produk"
 LIMIT 10
SELECT COUNT(*) AS "numrows"
FROM "produk"
SELECT COUNT(*) AS "numrows" FROM "produk"
---
    public function index()
    {
        $model = new M_Produk();

        $session = session();

        // Cek apakah pengguna sudah login
        if (!$session->get('isLoggedIn')) {
            return redirect()->to('/login')->with('error', 'Silakan login terlebih dahulu!');
        }

        $search = $this->request->getVar('search') ?? '';
        $kategori = $this->request->getVar('kategori') ?? 'semua';

        // Mengambil data produk
        if ($kategori === 'semua') {
            $produk = $model->like('nama_produk', $search)->orLike('kategori_produk', $search)->findAll();
        } else {
            $produk = $model->where('kategori_produk', $kategori)->like('nama_produk', $search)->findAll();
        }

        // Tentukan jumlah data per halaman
        $perPage = 10; // Contoh 10 data per halaman

        // Ambil halaman saat ini
        $currentPage = $this->request->getVar('page') ? $this->request->getVar('page') : 1;

        // Ambil data produk dengan pagination
        $produk = $model->paginate($perPage, 'produk', $currentPage);

        $data = [
            'title' => 'Daftar Produk',
            'produk' => $produk,
            'pager' => $model->pager,
            'perPage' => $perPage,
            'currentPage' => $currentPage,
            'totalItems' => $model->countAll(),
        ];